<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        DB::table('ministries')->insert(
            [
                ['name'=>'စီမံကိန်းနှင့်ဘဏ္ဍာရေး'],
                ['name'=>'လျှပ်စစ်နှင့်စွမ်းအင်'],
                ['name'=>'ဆောက်လုပ်ရေး'],
                ['name'=>'နိုင်ငံခြားရေး'],
                ['name'=>'ပြည်ထဲရေး'],
                ['name'=>'ပညာရေး'],
                ['name'=>'ကျန်းမာရေးနှင့်အားကစား'],
                ['name'=>'စိုက်ပျိုးရေး၊မွေးမြူရေးနှင့်ဆည်မြောင်း'],
                ['name'=>'စက်မှု'],
                ['name'=>'အပြည်ပြည်ဆိုင်ရာပူးပေါင်းဆောင်ရွက်ရေး'],
                ['name'=>'နယ်စပ်ရေးရာ'],
                ['name'=>'ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေး'],
                ['name'=>'စီးပွားရေးနှင့်ကူးသန်းရောင်း၀ယ်ရေး'],
                ['name'=>'တိုင်းရင်းသားလူမျိုးများရေးရာ'],
                ['name'=>'လူမှု၀န်ထမ်းကယ်ဆယ်ရေးနှင့်ပြန်လည်နေရာချထားရေး'],
                ['name'=>'ဟိုတယ်နှင့်ခရီးသွားလာရေး'],
                ['name'=>' ကာကွယ်ရေး'],
                ['name'=>'သာသနာရေးနှင့်ယဥ်ကျေးမှု'],
                ['name'=>'သယံဇာတနှင့်သဘာ၀ပတ်၀န်းကျင်ထိန်းသိမ်းရေး'],
                ['name'=>'လယ်ယာစိုက်ပျိုးရေးနှင့်ဆည်မြောင်း'],
                ['name'=>'အလုပ်သမား၊လူ၀င်မှုကြီးကြပ်ရေးနှင့်ပြည်သူ့အင်အား'],
                ['name'=>'နိုင်ငံတော်သမ္မတရုံး'],
                ['name'=>'ပြန်ကြားရေး'],

            ]);

    }
}
